app/controllers/boxes_controller.rb

SELECT * FROM "boxes" WHERE ("boxes"."id" = 1)
---
  def find_box_account(box_id, month, year)
    @box = Box.find(box_id)